In [2]:
### Pandas - Dataframe and Series

# It is a data manipulation library for python. It is used for data mining and data cleaning. 
# It provides 2 data structures: Series (1D) and Dataframe (2D).

!pip install pandas

Collecting pandas
  Downloading pandas-2.2.3-cp313-cp313-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\user\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2024.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.1-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\user\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.2.3-cp313-cp313-win_amd64.whl (11.5 MB)
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ------ --------------------------------- 1.8/11.5 MB 12.1 MB/s eta 0:00:01
   ------------- -------------------------- 3.9/11.5 MB 10.2 MB/s eta 0:00:01
   ------------------------ --------------- 7.1/11.5 MB 11.7 MB/s eta 0:00:01
   ----------------------------------- ---- 10.2/11.5 MB 12.4 MB/s eta 0:00:01
   ---------------------------------------- 11.5/11.5 MB 11.4 MB/s eta 0:00:00
Downloading pytz-2024.2-py2.py3-none-any.whl (508 kB)
Downloading tzdata-2025.1-py2.py3-none-any.whl (346 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.3 pytz-2024.2 tzdata-2025.1

[notice] A new release of pip is available: 24.2 -> 25.0
[notice] To update, run: python.exe -m pip install --upgrade pip

In [4]:
import pandas as pd

In [5]:
### Series - one D array-like object. Holds any data type.

data = [1,2,3,4,5]

series = pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [10]:
# Series with dictionary

data = {"a": 1, "b": 2, "c": 3}
series = pd.Series(data)

print(series)
print(series['b'])

data1 = [1,2,3]
index1 = ['a', 'b', 'c']

series1 = pd.Series(data1, index1)
print(series1)

a    1
b    2
c    3
dtype: int64
2
a    1
b    2
c    3
dtype: int64

In [12]:
### Dataframe - 2D array like object in tabular form. List of series.

# Dataframe from dictionary

data = {
    'Name': ["Ajay", "Bijay", "Bijina"],
    "Age": [24, 24, 25],
    "City": ["Ottawa", "Toronto", "Sudbury"]
}

df = pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age     City
0    Ajay   24   Ottawa
1   Bijay   24  Toronto
2  Bijina   25  Sudbury
<class 'pandas.core.frame.DataFrame'>

In [14]:
# Dataframe from a list of dictionaries

data = [
    {"a": 1, "b": 2, "c": 3},
    {"a": 1, "b": 3, "c": 3},
    {"a": 2, "b": 6, "c": 9},
]

df = pd.DataFrame(data)
print(df)

   a  b  c
0  1  2  3
1  1  3  3
2  2  6  9

In [17]:
# Read csv file

df = pd.read_csv('sales_data.csv')
df.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [78]:
# Indexing in dataframe

data = {
    'Name': ["Ajay", "Bijay", "Bijina", "Subash"],
    "Age": [24, 24, 25, 34],
    "City": ["Ottawa", "Toronto", "Sudbury", "Palpa"]
}

df = pd.DataFrame(data)
df

df

     Name  Age     City
0    Ajay   24   Ottawa
1   Bijay   24  Toronto
2  Bijina   25  Sudbury
3  Subash   34    Palpa

In [48]:
### loc - label based indexing, includes first and last index

# df.loc[0:2, ["Name", "City"]]

### iloc - index based indexing, includes the first index

df.iloc[0:2, [0,1,2]]
df.iloc[1, [2]]

### accessing a specific element

df.at[3, 'Name']
df.iat[3,2]

'Palpa'

In [83]:
# Data manipulation with dataframe

df['Salary'] = [50000, 40000, 30000, 20000]
df.drop('Salary', axis=1, inplace=True)

df['Age'] = df['Age'] + 5
df.describe()

             Age
count   4.000000
mean   51.750000
std     4.856267
min    49.000000
25%    49.000000
50%    49.500000
75%    52.250000
max    59.000000